<?php
/**
 *
 *  _____                                                                                _____
 * ( ___ )                                                                              ( ___ )
 *  |   |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|   |
 *  |   |                                                                                |   |
 *  |   |                                                                                |   |
 *  |   |    ________  ___       __   _______   _______   ________                       |   |
 *  |   |   |\   __  \|\  \     |\  \|\  ___ \ |\  ___ \ |\   ____\                      |   |
 *  |   |   \ \  \|\  \ \  \    \ \  \ \   __/|\ \   __/|\ \  \___|_                     |   |
 *  |   |    \ \  \\\  \ \  \  __\ \  \ \  \_|/_\ \  \_|/_\ \_____  \                    |   |
 *  |   |     \ \  \\\  \ \  \|\__\_\  \ \  \_|\ \ \  \_|\ \|____|\  \                   |   |
 *  |   |      \ \_____  \ \____________\ \_______\ \_______\____\_\  \                  |   |
 *  |   |       \|___| \__\|____________|\|_______|\|_______|\_________\                 |   |
 *  |   |             \|__|                                 \|_________|                 |   |
 *  |   |    ________  ________  ________  _______   ________  ________  ________        |   |
 *  |   |   |\   ____\|\   __  \|\   __  \|\  ___ \ |\   __  \|\   __  \|\   __  \       |   |
 *  |   |   \ \  \___|\ \  \|\  \ \  \|\  \ \   __/|\ \  \|\  \ \  \|\  \ \  \|\  \      |   |
 *  |   |    \ \  \    \ \  \\\  \ \   _  _\ \  \_|/_\ \   ____\ \   _  _\ \  \\\  \     |   |
 *  |   |     \ \  \____\ \  \\\  \ \  \\  \\ \  \_|\ \ \  \___|\ \  \\  \\ \  \\\  \    |   |
 *  |   |      \ \_______\ \_______\ \__\\ _\\ \_______\ \__\    \ \__\\ _\\ \_______\   |   |
 *  |   |       \|_______|\|_______|\|__|\|__|\|_______|\|__|     \|__|\|__|\|_______|   |   |
 *  |   |                                                                                |   |
 *  |   |                                                                                |   |
 *  |___|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|___|
 * (_____)                                                                              (_____)
 *
 * Эта программа является свободным программным обеспечением: вы можете распространять ее и/или модифицировать
 * в соответствии с условиями GNU General Public License, опубликованными
 * Фондом свободного программного обеспечения (Free Software Foundation), либо в версии 3 Лицензии, либо (по вашему выбору) в любой более поздней версии.
 *
 * @author TimQwees
 * @link https://github.com/TimQwees/Qwees_CorePro
 *
 */

namespace App\Controllers;
use App\Models\Network\Network;
use App\Models\Network\Message;

class MailController
{
  /**
   * __Отправка письма по Email__
   *
   * *Позволяет отправить email-письмо при указании валидных адресата, темы и содержимого.*
   *
   * ---
   * ### Особенности:
   * - Проверяет валидность всех аргументов (`email`, `тема`, `тело письма`)
   * - Формирует email и отправляет его с помощью `Network::onPHPMailer`
   * - Обрабатывает исключения, возвращает `false` и записывает ошибку через `Message`
   *
   * ---
   * **Параметры:**
   * - `string $to_mail` — _Email-адрес получателя_
   * - `string $subject` — _Тема письма_
   * - `string $body` — _Основное содержимое письма (plain text или HTML)_
   *
   * ---
   * **Возвращает:**
   * `true`     — если письмо успешно отправлено
   * `false`    — если возникла ошибка (детали в `Message`)
   *
   * ---
   * **Пример использования:**
   * ```php
   * $this->onMail(
   *     'you@wondermail.com',
   *     'Подписка активирована!',
   *     'Добро пожаловать!'
   * );
   * ```
   */
  public function onMail(string $to_mail, string $subject, string $body)
  {
    if (empty($to_mail)) {
      message::set('error', "Пустой email получателя!");
      return false;
    } elseif (empty($subject)) {
      message::set('error', "Пустая тема письма!");
      return false;
    } elseif (empty($body)) {
      message::set('error', "Пустое содержание письма!");
      return false;
    }

    $mailer = [
      "to_email" => $to_mail,//Получатель
      "subject" => $subject,//заголовок
      "body" => $body,//сообщение
    ];

    try {
      return (new Network())->onPHPMailer($mailer);//отправка запроса/send request;
    } catch (\Exception $e) {
      message::set('error', "Ошибка отправки письма: " . $e->getMessage());
      return false;
    }
  }
}
